digital-deck-server/load_testing/join-lobby-load-test.yml
config:
  target: "http://35.192.81.46:3000"
  phases:
    - duration: 30
      arrivalRate: 20
      name: "Starting up join sessions"
    - duration: 120
      arrivalRate: 20
      rampTo: 100
      name: "Increasing load"
  ensure:
    p99: 150
    maxErrorRate: 1
    max: 500


scenarios:
  - name: "Join Lobby"
    flow:
      - get:
          url: "/"
      - think: 1
      - post:
          url: "/session/join"
          json:
            name: "test"
            sessionId: "330"